<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uploads files from munki_repo to AirWatch</string>
        <key>Identifier</key>
        <string>com.github.autopkg.airwatch.importer</string>
        <key>Input</key>
        <dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>AWImportProcessor</string>
                <key>Arguments</key>
                <dict>
                    <key>munki_repo_path</key>
                    <string>%MUNKI_REPO%</string>
                    <key>airwatch_url</key>
                    <string>%AIRWATCH_URL</string>
                    <key>airwatch_groupid</key>
                    <string>%AIRWATCH_GROUPID</string>
                    <key>api_token</key>
                    <string>%API_TOKEN</string>
                    <key>api_username</key>
                    <string>%API_USERNAME</string>
                    <key>api_password</key>
                    <string>%API_PASSWORD</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
